import discord
import asyncio
import time
from discord.ext import commands


async def 안녕(ctx):
    await ctx.channel.send('나도 안녕!')
    await print(time.ctime(), 안녕.__name__)

async def 죽어(ctx):
    await ctx.channel.send('으앙 미안 ㅜㅜ')
    await print(time.ctime(), 죽어.__name__)

async def 지건(ctx):
    await ctx.channel.send('람각')
    await print(time.ctime(), 지건.__name__)

async def ggez(ctx):
    await ctx.channel.send('░░░░░░░░░░░░░░░░░░░░░░░░░░\n░░░█▀▀▀░█▀▀▀░░█▀▀░▀▀█░░█░░\n░░░█░▀█░█░▀█░░█▀▀░▄▀░░░▀░░\n░░░▀▀▀▀░▀▀▀▀░░▀▀▀░▀▀▀░░▀░░\n░░░░░░░░░░░░░░░░░░░░░░░░░░\n⎛⎝(•‿•)⎠⎞⎛⎝(•‿•)⎠⎞⎛⎝(•‿•)⎠⎞⎛⎝(•‿•)⎠⎞')
    await print(time.ctime(), ggez.__name__)

async def 주사위굴려(ctx):
    await ctx.channel.send('░░░░░░░░░░░░░░░░░░░░░░░░░░░░░\n░▀█▀░░█░█░░█▀█░█░▀▀█░▀█░░█░█░\n░▀░▀░░█░█░░▀▀▀░█░▀█▀░█▀░▀█░▀░\n░▀█▀░▀░▀█▀░▀█▀▀█░▀▀█░▀▀░▀█░▀░\n░░▀░░░░░▀░░░▀░░▀░█▀▀░░░░░▀░░░\n░░░░░░░░░░░░░░░░░▀▀▀░░░░░░░░░')
    await print(time.ctime(), 주사위굴려.__name__)

async def 꽁승(ctx):
    await ctx.channel.send('╭━━━━━━╮\n╰┃ ┣▇━▇\n ┃ ┃  ╰━▅╮\n ╰┳╯ ╰━━┳╯ 공짜 승리!\n  ╰╮ ┳━━╯ SUPER EASY\n ▕▔▋ ╰╮╭━╮우리 또 만나요!🖐\n╱▔╲▋╰━┻┻╮╲╱▔▔▔╲\n▏  ▔▔▔▔▔▔▔  O O┃\n╲╱▔╲▂▂▂▂╱▔╲▂▂▂╱\n ▏╳▕▇▇▕ ▏╳▕▇▇▕')
    await print(time.ctime(), 꽁승.__name__)

async def 굴려(ctx):
    await ctx.channel.send('⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⣩⣍⡻⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣟⠉⣉⠙⣿⣿⡟⠩⣴⣿⡋⠙⣿⣷⡍⠛⣿⣿⣿⣿⣿⣏⠉⢻⣿⣿\n⣿⣟⠛⢛⣛⠁⢈⣉⣿⡇⡗⢲⣝⡻⠿⢛⡥⠒⠇⣿⣿⠶⠖⠀⣍⠀⢸⣿⣿\n⣿⣿⣿⡯⠤⠤⢸⣿⣿⡇⣷⣾⣿⣿⢸⡿⠉⣶⡇⣿⣿⣷⠀⠋⣤⠀⢸⣿⣿\n⣿⣿⣿⣿⣄⣉⣩⣿⣿⣇⡛⢿⣄⣹⢸⢉⡿⢟⣡⣿⣿⣿⣿⣿⣿⣀⣾⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⣙⢘⣥⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿')
    await print(time.ctime(), 굴려.__name__)

async def 탑차이(ctx):
    await ctx.channel.send('░░░░░░░░░░░░░░░░░░░░░░░░░░\n░░░░█▀▀▀░░▄▄█▄▄░░▄▀▀▄░░░░░\n░░░░█▀▀▀░░▄▀░▀▄░░█░░█░░░░░\n░░░░▀▀▀▀░░▀░░░▀░░▀▄▄▀░░░░░\n░░░░░░░░░░░░░░░░░░░░░░░░░░')
    await print(time.ctime(), 탑차이.__name__)